<?php

return [

    /*
    |--------------------------------------------------------------------------
    | Stateful Domains
    |--------------------------------------------------------------------------
    |
    | 從這些網域發出的請求將接收有狀態的 API 身份驗證 cookie。
    | 通常，這些應該包括您的本地和生產網域，這些網域使用 SPA 或
    | 使用 Laravel Sanctum 進行身份驗證的移動應用程式存取您的 API。
    |
    */

    'stateful' => explode(',', env('SANCTUM_STATEFUL_DOMAINS', sprintf(
        '%s%s',
        'localhost,localhost:3000,127.0.0.1,127.0.0.1:8000,::1',
        env('APP_URL') ? ','.parse_url(env('APP_URL'), PHP_URL_HOST) : ''
    ))),

    /*
    |--------------------------------------------------------------------------
    | Sanctum Guards
    |--------------------------------------------------------------------------
    |
    | 此陣列包含應檢查傳入請求的身份驗證防護。如果使用任何列出的
    | 防護成功驗證了請求，Sanctum 將返回有效的身份驗證響應。
    |
    */

    'guard' => ['web'],

    /*
    |--------------------------------------------------------------------------
    | Expiration Minutes
    |--------------------------------------------------------------------------
    |
    | 此值控制發出的令牌被視為過期之前的分鐘數。如果設置為 null，
    | 個人訪問令牌將永不過期。這不會影響有狀態的身份驗證。
    |
    */

    'expiration' => null,

    /*
    |--------------------------------------------------------------------------
    | Sanctum Middleware
    |--------------------------------------------------------------------------
    |
    | 在使用 Sanctum 的令牌身份驗證時，您可能需要自定義一些中介軟體
    | Sanctum 使用。您可以在此處覆蓋任何中介軟體。
    |
    */

    'middleware' => [
        'verify_csrf_token' => App\Http\Middleware\VerifyCsrfToken::class,
        'encrypt_cookies' => App\Http\Middleware\EncryptCookies::class,
    ],

];
